#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.db_password: Refreshing state... [id=none]
aws_cloudwatch_event_rule.siteminder-tests-scheduler: Refreshing state... [id=siteminder-tests-scheduler]
data.aws_subnet.b_data: Reading...
aws_efs_file_system.efs_sso_grafana[0]: Refreshing state... [id=fs-061ba5a1b4ab729d9]
module.db.data.aws_partition.current: Reading...
aws_cloudwatch_event_rule.request_queue: Refreshing state... [id=request-queue-scheduler]
data.aws_subnet.a_data: Reading...
data.aws_iam_policy.grafana_read_secret[0]: Reading...
aws_iam_role.redis_container_role[0]: Refreshing state... [id=redis-container-role]
aws_apigatewayv2_api.grafana[0]: Refreshing state... [id=598fmku1h4]
aws_acm_certificate.status: Refreshing state... [id=arn:aws:acm:ca-central-1:220881534007:certificate/2e58268b-94ea-4be2-b113-56707b57fb86]
module.db.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-api-swagger]
data.aws_vpc.selected: Reading...
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
data.aws_secretsmanager_secret_version.grafana_secret[0]: Reading...
data.aws_subnet.a_data: Read complete after 0s [id=subnet-0a663db91e3d61619]
data.aws_security_group.app: Reading...
data.aws_subnet.b_data: Read complete after 0s [id=subnet-0d0e52f2aabe9cd5d]
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=1077804475]
data.aws_subnet.b: Reading...
data.aws_security_group.web: Reading...
data.aws_security_group.app: Read complete after 1s [id=sg-04d2b964878cd6013]
data.aws_iam_policy.permissions_boundary_policy: Reading...
data.aws_subnet.b: Read complete after 1s [id=subnet-048e25be105ae01d3]
aws_ecs_cluster.sso_ecs_cluster: Refreshing state... [id=arn:aws:ecs:ca-central-1:220881534007:cluster/sso-ecs-cluster]
data.aws_subnet.a: Reading...
data.aws_secretsmanager_secret_version.grafana_secret[0]: Read complete after 1s [id=sso-grafana|AWSCURRENT]
aws_dynamodb_table.state_locking: Refreshing state... [id=xgr00q-dev-state-locking]
data.aws_security_group.web: Read complete after 1s [id=sg-0e52d9b846d88fbe5]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:220881534007:certificate/399165e3-6c0b-4264-940c-3a960e4b86b0]
data.aws_subnet.a: Read complete after 0s [id=subnet-0896ff158c3ecdc53]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_cloudwatch_event_rule.request_monitor: Refreshing state... [id=request-monitor-scheduler]
aws_apigatewayv2_stage.grafana[0]: Refreshing state... [id=$default]
aws_efs_backup_policy.efs_sso_grafana_backups_policy[0]: Refreshing state... [id=fs-061ba5a1b4ab729d9]
data.aws_vpc.selected: Read complete after 1s [id=vpc-018906cab60cf165b]
aws_efs_access_point.sso_grafana_efs_access_point[0]: Refreshing state... [id=fsap-0927ac0992f0719f8]
aws_efs_mount_target.efs_sso_grafana_azB[0]: Refreshing state... [id=fsmt-02c93faa8fde64452]
aws_efs_mount_target.efs_sso_grafana_azA[0]: Refreshing state... [id=fsmt-01b346e841c1dc5e2]
aws_iam_role_policy.redis_cwlogs[0]: Refreshing state... [id=redis-container-role:redis-cw-logs]
aws_alb.sso_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:220881534007:loadbalancer/app/sso-alb/359670adc4ad1559]
aws_apigatewayv2_vpc_link.grafana[0]: Refreshing state... [id=1k9kom]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_ecs_cluster_capacity_providers.sso_ecs_cluster_capacity_providers: Refreshing state... [id=sso-ecs-cluster]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api-dev.loginproxy.gov.bc.ca]
aws_api_gateway_resource.api: Refreshing state... [id=9jt82m]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=etb5fq]
aws_api_gateway_resource.app: Refreshing state... [id=guevy4]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
aws_alb_target_group.grafana[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:220881534007:targetgroup/grafana/79852db824ee9dff]
aws_lb_target_group.redis[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:220881534007:targetgroup/redis/8d617b2aa3977eb3]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_versioning.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.data.aws_iam_policy_document.deny_non_secure_access_doc: Reading...
module.s3_keycloak_v2.data.aws_iam_policy_document.deny_non_secure_access_doc: Read complete after 0s [id=2675888125]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=qorb7e]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=ogj40z]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=uysksd]
aws_api_gateway_resource.app_proxy: Refreshing state... [id=bog9v3]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=zfeccr]
aws_lambda_function.siteminder-tests-scheduler: Refreshing state... [id=lambda-siteminder-tests-scheduler]
aws_lb.redis_nlb[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:220881534007:loadbalancer/net/redis-nlb/fa2a0d5c15da05b0]
module.s3_keycloak_v2.aws_s3_bucket_policy.deny_non_secure_access_policy: Refreshing state... [id=xgr00q-dev-keycloak]
data.aws_iam_policy.grafana_read_secret[0]: Read complete after 2s [id=arn:aws:iam::220881534007:policy/SSOPathfinderReadGrafanaSecret]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_versioning.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_sso_api_swagger.data.aws_iam_policy_document.deny_non_secure_access_doc: Reading...
module.s3_sso_api_swagger.data.aws_iam_policy_document.deny_non_secure_access_doc: Read complete after 0s [id=3215802891]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-api-swagger,private]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-gcp9dahm4c-qorb7e-GET]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-gcp9dahm4c-ogj40z-GET]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-gcp9dahm4c-uysksd-ANY]
aws_alb_listener.grafana[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:220881534007:listener/app/sso-alb/359670adc4ad1559/9ab64d0ecec2b4ad]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
data.aws_iam_policy.permissions_boundary_policy: Read complete after 2s [id=arn:aws:iam::220881534007:policy/sso-requests-boundary]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_api_gateway_method.app_proxy: Refreshing state... [id=agm-gcp9dahm4c-bog9v3-ANY]
module.s3_sso_api_swagger.aws_s3_bucket_policy.deny_non_secure_access_policy: Refreshing state... [id=xgr00q-dev-api-swagger]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-gcp9dahm4c-ogj40z-GET-200]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-gcp9dahm4c-ogj40z-GET]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-gcp9dahm4c-qorb7e-GET-200]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-gcp9dahm4c-qorb7e-GET]
aws_lb_listener.redis[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:220881534007:listener/net/redis-nlb/fa2a0d5c15da05b0/dc608fb3e67f10f5]
aws_iam_role.redis_task_execution_role[0]: Refreshing state... [id=RedisECSTaskExecutionRole]
aws_iam_role.grafana_container_role[0]: Refreshing state... [id=grafana-container-role]
aws_iam_role.grafana_task_execution_role[0]: Refreshing state... [id=GrafanaECSTaskExecutionRole]
aws_apigatewayv2_integration.grafana[0]: Refreshing state... [id=fm7ckzr]
aws_cloudwatch_event_target.siteminder-tests-scheduler: Refreshing state... [id=siteminder-tests-scheduler-siteminder-tests-scheduler]
aws_lambda_permission.siteminder-tests-scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-gcp9dahm4c-qorb7e-GET-200]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-gcp9dahm4c-ogj40z-GET-200]
aws_apigatewayv2_route.grafana[0]: Refreshing state... [id=vpvo6b6]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.request_queue: Refreshing state... [id=request-queue]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.request_monitor: Refreshing state... [id=request-monitor]
aws_iam_role_policy.redis_task_execution_cwlogs[0]: Refreshing state... [id=RedisECSTaskExecutionRole:redis-task-exec-cwlogs]
aws_iam_role_policy_attachment.grafana["arn:aws:iam::aws:policy/AmazonRDSReadOnlyAccess"]: Refreshing state... [id=GrafanaECSTaskExecutionRole-20241023230732428200000001]
aws_iam_role_policy_attachment.grafana["arn:aws:iam::220881534007:policy/SSOPathfinderReadGrafanaSecret"]: Refreshing state... [id=GrafanaECSTaskExecutionRole-20241023230732566500000003]
aws_iam_role_policy.grafana_task_execution_cwlogs[0]: Refreshing state... [id=GrafanaECSTaskExecutionRole:grafana-task-exec-cwlogs]
aws_iam_role_policy_attachment.grafana["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"]: Refreshing state... [id=GrafanaECSTaskExecutionRole-20241023230732505100000002]
aws_iam_role_policy.grafana_cwlogs[0]: Refreshing state... [id=grafana-container-role:grafana-cw-logs]
aws_ecs_task_definition.grafana[0]: Refreshing state... [id=grafana]
aws_iam_role_policy.grafana_container_efs_access[0]: Refreshing state... [id=grafana-container-role:grafana-container-efs-access]
aws_ecs_service.grafana[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:220881534007:service/sso-ecs-cluster/grafana]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.app: Refreshing state... [id=agi-gcp9dahm4c-bog9v3-ANY]
aws_ecs_task_definition.redis[0]: Refreshing state... [id=redis]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-gcp9dahm4c-uysksd-ANY]
aws_lambda_permission.request_queue: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.request_queue: Refreshing state... [id=request-queue-scheduler-request_queue]
aws_lambda_permission.request_monitor: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.request_monitor: Refreshing state... [id=request-monitor-scheduler-request_monitor]
aws_api_gateway_deployment.this: Refreshing state... [id=0lt1jr]
aws_ecs_service.redis[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:220881534007:service/sso-ecs-cluster/redis]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "db" {
      + function_name = "lambda-db"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2025-04-16T22:06:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "+CPgzAIZs7rcYEtnbVvUwrYB1nrPx7TdTP6YLHnj57c=" -> "CZv40lnjsITVWWXq3B1yMeZUGnUU8vHj2CHVN3pX7xA="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2025-04-16T22:06:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "5tkYctJcDD0gbboLtUCIDgTcVNDAVrpRd5hSdS+qqRM=" -> "sp3uePPlyuogeNVMf+svad1Ap2ypicOxtMl9eIIOavw="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2025-04-16T22:06:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "cEdWt2IKcoHHuITQ5LqRRI9+Eac6P7hOKW8TJB2MBmo=" -> "vkafiIDNZn7DpaLZfRE3cOFeh50wQ6+rALv4BfAh9zs="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.request_monitor will be updated in-place
  ~ resource "aws_lambda_function" "request_monitor" {
        id                             = "request-monitor"
      ~ last_modified                  = "2025-04-16T22:06:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "E2++3rfq3R4eUCNl8eAJ4kNY8liaIi2MyyEKq7MTxVA=" -> "awTFLyvVaKAeJVM5aVKR0wNQ9EgzqsqiIribtB/atc4="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.request_queue will be updated in-place
  ~ resource "aws_lambda_function" "request_queue" {
        id                             = "request-queue"
      ~ last_modified                  = "2025-04-16T22:06:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "J5n2ieWcGwhB5zyE7OJKQJUbOwUf5NIxP5/kgPVR4Rs=" -> "XdrOX3VEqysU1SGRe/Rkm4QfkBJSuQMT+uHJsio2yyI="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.siteminder-tests-scheduler will be updated in-place
  ~ resource "aws_lambda_function" "siteminder-tests-scheduler" {
        id                             = "lambda-siteminder-tests-scheduler"
      ~ last_modified                  = "2025-04-16T22:06:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "opnUGLftgPyuz9Hct4QipW2XieSmJuQt+E9BP+CUOXs=" -> "hhPAJpRZ7AeMvyxTB0BhegEs9Ng67MuJ9W5Rs3yylSI="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2025-04-16T22:06:37.101Z"
        }
      - statusCode = 200
    } -> (known after apply)

Warning: Argument is deprecated

  with aws_api_gateway_deployment.this,
  on api-gateway.tf line 197, in resource "aws_api_gateway_deployment" "this":
 197:   stage_name  = "test"

stage_name is deprecated. Use the aws_api_gateway_stage resource instead.

(and one more similar warning elsewhere)

Warning: Deprecated attribute

  on api-gateway.tf line 227, in output "base_url":
 227:   value = aws_api_gateway_deployment.this.invoke_url

The attribute "invoke_url" is deprecated. Refer to the provider documentation
for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jlangy, Action: `pull_request`*